{
    "english_language": {
        "agents": ["Sam", "John", "Tom"],
        "random_response": ["I am good", "I am fine", "I am great"],
        "keyword_response": {
            
                "library": "The library is located on the second floor and is open from 8 AM to 8 PM.",
                "cafeteria": "The cafeteria is on the ground floor, serving meals from 9 AM to 7 PM.",
                "sports_center": "The sports center is near the main gate and operates from 6 AM to 9 PM.",
                "computer_lab": "The computer lab is on the third floor and is open from 9 AM to 6 PM.",
                "admissions_office": "The admissions office is at the main building's entrance and operates from 9 AM to 4 PM.",
                "parking_lot": "The parking lot is behind the campus and is open from 6 AM to 10 PM.",
                "student_lounge": "The student lounge is in the east wing, accessible from 8 AM to 6 PM.",
                "bookstore": "The bookstore is beside the cafeteria and is open from 9 AM to 5 PM.",
                "auditorium": "The auditorium is in the west block and is available for events from 10 AM to 7 PM.",
                "medical_room": "The medical room is on the first floor, open from 8 AM to 5 PM."
            
            
    
    }
    },
    "nepali_language": {
        "agents": ["Subash", "Prasun", "Prasanna"],
        "random_response": ["Maila bujina", "Feri vanus ta", "malai thavayana"],
        "keyword_response": {
            "library": "पुस्तकालय दोस्रो तल्लामा छ र बिहान ८ बजे देखि बेलुका ८ बजे सम्म खुला हुन्छ।",
            "cafeteria": "क्याफेटेरिया ग्राउन्ड फ्लोरमा छ र बिहान ९ बजे देखि बेलुका ७ बजे सम्म खाना उपलब्ध छ।",
            "sports_center": "खेलकुद केन्द्र मुख्य गेट नजिकै छ र बिहान ६ बजे देखि राति ९ बजे सम्म खुला हुन्छ।",
            "computer_lab": "कम्प्युटर ल्याब तेस्रो तल्लामा छ र बिहान ९ बजे देखि बेलुका ६ बजे सम्म खुला हुन्छ।",
            "admissions_office": "भर्ना कार्यालय मुख्य भवनको प्रवेशद्वारमा छ र बिहान ९ बजे देखि दिउँसो ४ बजे सम्म खुला हुन्छ।",
            "parking_lot": "पार्किङ क्षेत्र क्याम्पसको पछाडि छ र बिहान ६ बजे देखि राति १० बजे सम्म खुला हुन्छ।",
            "student_lounge": "विद्यार्थी लाउन्ज पूर्वी पंखमा छ, र बिहान ८ बजे देखि बेलुका ६ बजे सम्म पहुँचयोग्य छ।",
            "bookstore": "पुस्तक पसल क्याफेटेरियाको छेउमा छ र बिहान ९ बजे देखि बेलुका ५ बजे सम्म खुला हुन्छ।",
            "auditorium": "सभाकक्ष पश्चिम ब्लकमा छ र बिहान १० बजे देखि बेलुका ७ बजे सम्म कार्यक्रमका लागि उपलब्ध छ।",
            "medical_room": "चिकित्सा कक्ष पहिलो तल्लामा छ र बिहान ८ बजे देखि बेलुका ५ बजे सम्म खुला हुन्छ।"
        }
        
    },
    "spanish_language": {
        "agents": ["Juan", "Pedro", "Maria"],
        "random_response": ["Estoy bien", "Estoy genial", "Estoy muy bien"],
        "keyword_response": {
        
                "biblioteca": "La biblioteca está ubicada en el segundo piso y está abierta de 8 AM a 8 PM.",
                "cafetería": "La cafetería está en la planta baja y sirve comidas de 9 AM a 7 PM.",
                "centro_deportes": "El centro deportivo está cerca de la entrada principal y opera de 6 AM a 9 PM.",
                "laboratorio_computación": "El laboratorio de computación está en el tercer piso y está abierto de 9 AM a 6 PM.",
                "oficina_admisiones": "La oficina de admisiones está en la entrada del edificio principal y opera de 9 AM a 4 PM.",
                "estacionamiento": "El estacionamiento está detrás del campus y está abierto de 6 AM a 10 PM.",
                "sala_estudiantes": "La sala de estudiantes está en el ala este, accesible de 8 AM a 6 PM.",
                "librería": "La librería está junto a la cafetería y está abierta de 9 AM a 5 PM.",
                "auditorio": "El auditorio está en el bloque oeste y está disponible para eventos de 10 AM a 7 PM.",
                "sala_médica": "La sala médica está en el primer piso y está abierta de 8 AM a 5 PM."
            
            
        }
    }
}
